[
    "Tell me about yourself.",
    "Have you done anything exciting lately?",
    "What made you smile today?",
    "How did you meet the host?",
    "What's your favorite form of social media?",
    "What was the last good book you read?",
    "Do you listen to any podcasts? Which is your favorite?",
    "What do you think is the best show on Netflix right now?",
    "Have you been on any interesting trips lately?",
    "What do you think has been the best movie of the year so far?",
    "What song do you wish you could put on right now?",
    "Are you a cat person or a dog person?",
    "Do you think you're an introvert or an extrovert?",
    "If you didn't have the job you have now, what would you be?",
    "What's your strangest hidden talent?",
    "What is something people are always surprised to learn about you?",
    "What is the most rewarding part of your career?",
    "Where do you want to be in five years?",
    "What superpower do you wish you could have?",
    "Where would you go on vacation if you had no budget?",
    "If you could travel back in time, what decade would you choose to live in?",
    "What's the best thing you've ever bought off Amazon?",
    "What's the last concert you went to?",
    "What is one thing you can't live without?",
    "What's the strangest dream you've had recently?",
    "What is your favorite book of all time?",
    "How many countries have you been to?",
    "What's your favorite city you've visited?",
    "Would you rather travel via plane or boat?",
    "Would you rather be really hot or really cold?",
    "What are your thoughts on the British royal family?",
    "Do you like documentaries? Have you watched any good ones recently?",
    "Who is your favorite celebrity couple ever?",
    "Which celebrity couple do you wish would get back together?",
    "If you could host a talk show, who would you have on first?",
    "What's your favorite sport?",
    "What sport do you wish you were really good at?",
    "What's the best holiday?",
    "How did you spend your last birthday?",
    "Do you believe men and women can ever just be friends?",
    "What are your long-term goals?",
    "Who is your role model?",
    "What did you want to be when you were a kid?",
    "What is your biggest regret in life?",
    "What are the top three things on your bucket list?",
    "What has been your biggest accomplishment so far?",
    "What is one thing you wish you could do that you know you probably never will?",
    "What are you most afraid of?",
    "What's the biggest risk you've ever taken?",
    "Tell me about the most life-changing piece of advice you've ever heard.",
    "When are you the most happy?",
    "What always calms you down when you're really stressed out and upset?",
    "Who in your life has had the most influence on you?",
    "What's the hardest thing you've ever done?",
    "What scares you the most about the future?",
    "How have your priorities changed in the last 10 years?",
    "What's the nicest thing anyone has ever done for you?",
    "Describe your perfect weekend.",
    "What's the most controversial opinion you have?",
    "If you could change one thing about your personality, what would it be?",
    "What's the first thing you would do if you won the lottery?",
    "If you could invite one famous person to dinner, who would it be?",
    "Who do you miss the most from your past?",
    "If you could go back in time, what is one situation you would do differently?",
    "Who is the most important person in your life right now?",
    "What did you think you would be doing at this age when you were a kid?",
    "Do you think social media is destroying our communication?",
    "What piece of technology could you live without?",
    "What do you think the world will be like 20 years in the future?",
    "What is something you've failed at recently?",
    "What would you change about yourself if you could?",
    "What motivates you to work hard?",
    "What form of public transportation do you prefer? (air, boat, train, bus, car, etc.)",
    "What's the most spontaneous thing you've done lately?",
    "What two radio stations do you listen to in the car the most?",
    "If you could hire someone to help you, would it be with cleaning, cooking, or yard work?",
    "Would you rather vacation in Mexico or Alaska, and why?",
    "What is your favorite thing about your career?",
    "If you could live anywhere, where would it be?",
    "Who is your hero?",
    "What is your family member's proudest accomplishment?",
    "What is your favorite book to read?",
    "What are your hobbies?",
    "What is your biggest fear?",
    "If you could choose to do anything for a day, what would it be?",
    "What is the best gift you have been given?",
    "What really makes you angry?",
    "If you could choose to do anything for a day, what would it be?",
    "Would you rather win the lottery or work at the perfect job? And why?",
    "Have you ever had a nickname? What is it?",
    "What would you do if you won the lottery?",
    "Do you like or dislike surprises? Why or why not?",
    "Would you rather ride a bike, ride a horse, or drive a car?",
    "In the evening, would you rather play a game, visit a relative, watch a movie, or read?",
    "What is your favorite game or sport to watch and play?",
    "If you could only eat one meal for the rest of your life, what would it be?",
    "Who is your favorite author?",
    "What is your favorite family vacation?",
    "What is your biggest complaint about your job?",
    "Which would you rather do: wash dishes, mow the lawn, clean the bathroom, or vacuum the house?",
    "What is your proudest accomplishment?",
    "Would you rather win the lottery or work at the perfect job? And why?",
    "What's your favorite zoo animal?",
    "What makes you laugh the most?",
    "Who would you want to be stranded with on a deserted island?",
    "If you could go back in time to change one thing, what would it be?",
    "If you could share a meal with any 4 individuals, living or dead, who would they be?",
    "How many pillows do you sleep with?",
    "What's the longest you've gone without sleep (and why)?",
    "What's the tallest building you've been to the top in?",
    "What was the last movie you went to? What did you think?",
    "What did you want to be when you were small?",
    "Where do you see yourself in five years?",
    "If you were a superhero, what powers would you have?",
    "If money was no object, what would you do all day?",
    "If you could go back in time, what year would you travel to?",
    "List two pet peeves. Aside from necessities, what one thing could you not go a day without?",
    "How would your friends describe you?",
    "What would you sing at Karaoke night?",
    "What is the worst gift you have received?",
    "Do you consider yourself an introvert or an extrovert?",
    "What are you most thankful for?",
    "Which parent are you closer to and why?",
    "What are your thoughts on online dating or tinder?",
    "What's on your bucket list this year?",
    "How would you describe your best friend?",
    "What do you think of best friends of the opposite sex?",
    "What makes you feel accomplished?",
    "How do you feel about sharing your password with your partner?",
    "What was the best phase in your life?",
    "Would you still love your spouse if they were diagnosed with a terminal disease?",
    "What qualities do you admire about your parents?",
    "What are some of your favorite songs?",
    "What was the worst phase in your life?",
    "What is the craziest thing you've ever done and would you do it again?",
    "If a genie granted you 3 wishes right now, what would you wish for?",
    "Does your job make you happy?",
    "What's the one thing you would like to change about yourself?",
    "Would you ever take back someone who cheated?",
    "What is a relationship deal breaker for you?",
    "Are you more into looks or brains?",
    "When do you think a person is ready for marriage?",
    "Is what you're doing now what you always wanted to do growing up?",
    "Have you ever lost someone close to you?",
    "If you are in a bad mood, do you prefer to be left alone or have someone to cheer you up?",
    "What's the one thing that people always misunderstand about you?",
    "What is your idea of a perfect vacation?",
    "When was the last time you broke someone's heart?",
    "Would you relocate for love?",
    "What did you want to be when you were younger?",
    "What kind of parent do you think you will be?",
    "Do you judge a book by its cover?",
    "What's your biggest regret in life?",
    "Who is that one person you can talk to about just anything?",
    "What's an ideal weekend for you?",
    "Are you religious or spiritual?",
    "Would you take on your significant other's religion if they had one?",
    "Do you believe in second chances?",
    "What's been your biggest mistake so far in life and what did you learn from it?",
    "Where is your favorite place in the entire world to go? ",
    "What did your past relationship teach you?",
    "What's your philosophy in life?",
    "What are your top five favorite movies?",
    "What would you do if your parents didn't like your partner?",
    "Are you religious or spiritual?",
    "What's your favorite book/movie of all time and why did it speak to you so much?",
    "When have you felt your biggest adrenaline rush?",
    "Why did your last relationship end?",
    "Are you confrontational?",
    "Do you usually stay friends with your exes?",
    "What's your “and then it got worse” story?",
    "What's the best piece of advice someone has given you?",
    "What's something you learned recently that you really should have already known?",
    "What was something you ate regularly as a child but now cringe at the thought of eating?",
    "If you were an action figure, what accessories would you be sold with?",
    "What's the craziest thing you've ever done for love?",
    "Do you prefer being warmed when you're too cold or being cooled when you're too hot?",
    "What snack can you just not get enough of?",
    "Is flirting cheating?",
    "If you were given $15,000 to give the most amount of happiness to the most amount of people, what would you do?",
    "What piece of culture or trend has died out, but you would like to see it make a comeback?",
    "What do you most look forward to about getting old?",
    "What kinds of things are normal now but will be highly valued antiques a century later?",
    "What's the best practical joke you've pulled or seen pulled?",
    "What weird smell do you really enjoy?",
    "If you inherited a private jet from a stranger, what would you do with it?",
    "What do you wish you could re-live in your lifetime?",
    "What's an innocent mistake you made that had dramatic consequences?",
    "Have you ever trusted your boyfriend to buy clothes for you?",
    "What's something weird that you recommend everyone trying at least once?",
    "What country can you name but besides the name you know almost nothing else about it?",
    "What are you most grateful for?",
    "What would be the worst thing to put into a piñata?",
    "Would you go through a boyfriend's phone if you could?",
    "What's something horrible that we as humans have accepted, because that's just how things are; but actually things don't have to be that way at all?",
    "If you could hear every time someone said something good about you or something negative about you, which would you choose?",
    "What do you think people automatically assume about you when they look at you?",
    "Looking back on your life, what have you done that has given you the most satisfaction?",
    "What's the best gag gift you've ever seen or gotten?",
    "When was the last time you laughed so hard you cried?",
    "What would you do if your parents didn't like your partner?",
    "If you were forced to create a new dance move, what would it be and what would you call it?",
    "What's your story?",
    "What do you wish you had more time for?",
    "What do you like to do that is traditionally considered masculine?",
    "If everything was quantified, what life stats would like to see for yourself?",
    "What do you really wish you knew when you were younger?",
    "What options would come up if you could “right-click” people?",
    "What is your ideal meal?",
    "What songs can you sing that I'll know after hearing two words from the song?",
    "If you were given $20,000, but it could only be used to upgrade your shower or bathtub what upgrades would you make?",
    "When was the last time you had a gut feeling about something that turned out to be correct? How about a time your gut feeling was wrong?",
    "How decisive or indecisive are you?",
    "What's the biggest lie that a guy has told you?",
    "What would you do if one day you woke up and every person was just gone without a trace?",
    "What body feature do you pay the most attention to?",
    "Who do you make happy",
    "What's the most unpleasant sounding word?",
    "If you could dedicate your life to solving one problem, what problem would you choose?",
    "What was the worst phase you went through in life?",
    "What's the spiciest thing you've eaten? Would you ever eat it again?",
    "What unnecessary products or services do you consider necessary?",
    "Which fictional villain made you feel real hatred towards them?",
    "What habit do you have that you think not many other people have?",
    "How often is your brain on autopilot?",
    "What's the grossest thing you've drunk?",
    "If colors had a taste, what would each color taste like?",
    "What names were ruined for you because you knew someone terrible with that name?",
    "What's the best conspiracy theory you can make up on the spot?",
    "How often do you feel utterly worn down?",
    "What gross and unhygienic things do people do that bothers you?",
    "What was the best thing about how your parents raised you?",
    "Where is the craziest place you have danced?",
    "If when you died, you got put into a room for eternity with people who died the same way, how would you want to die?",
    "What would an amusement park filled with your biggest fears be like? What rides would it have?",
    "If jobs/careers had slogans what would be some of their slogans?",
    "What do people really need to chill out about?",
    "What are the two biggest lessons you've learned from previous relationships?",
    "Why do you think we dream?",
    "If you could switch genders for a length of time of your choosing, would you? And if so, how long?",
    "What inedible thing do you wish you could eat?",
    "Which hairstyles fit with which personalities?",
    "If you could choose the next president of the United States, who would it be?",
    "What's the most stress relieving thing you can get/do for less than 20$?",
    "What's something you wish you had never learned how it was made or how it works?",
    "What do most people overestimate or underestimate about you?",
    "What silly thing do you take a lot of pride in?",
    "What crazy things will you do if you ever become rich?",
    "If you were forced into a dance competition, what song would you choose to dance to?",
    "You have unlimited wishes but every time you make a wish what you love most is erased from the world. How many wishes do you make and what do you wish for? (No, you can't wish not to have things erased from the world.)",
    "How would the world change if health potions existed?",
    "How do you feel about God?",
    "What scrambles your brain every time you think about it?",
    "What's the weirdest wrong number text or phone call you've gotten?",
    "What would be the absolute perfect day?",
    "What's a lame joke you use on a regular basis?",
    "If you could change your first name, what would be the most epic name you could choose?",
    "What do you think aliens would actually look/be like?",
    "Should toilet paper hang over or under?",
    "How often do you go into a room and forget why you went into the room?",
    "What is the strongest animal you could win against with just your bare hands and feet?",
    "What event from the past do you most want to see a recording of?",
    "What would an amusement park designed specifically to make you happy, be like?",
    "What is something you probably should do, but will never do?",
    "What great idea would you like to try if you had enough money?",
    "If you were in a high-speed chase, what song would you want blaring on the radio?",
    "If you had to choose country music or rap, which would you choose?",
    "If you could only eat pizza or tacos, which would you choose?",
    "If you were given immortality, but there was one condition, what would stop you from accepting immortality?",
    "Do you like or dislike surprises? Why or why not?",
    "What's on your bucket list this year?",
    "What kind of parent do you think you will be?",
    "How do you feel about sharing your password with your partner?",
    "What is the craziest thing you've ever done and would you do it again?",
    "If a genie granted you 3 wishes right now, what would you wish for?",
    "What's your biggest regret in life?",
    "What jobs exist because people are selfish?",
    "What do you think about when you're by yourself?",
    "What is one dream you have yet to accomplish?",
    "Do you judge a book by its cover?",
    "What's the one thing that people always misunderstand about you?",
    "Are you confrontational?",
    "If you could change one thing about yourself what would it be?",
    "What makes you feel accomplished?",
    "When was the last time you broke someone's heart?",
    "What is your greatest fear?",
    "Who was your favorite teacher and why?",
    "What was the worst phase in your life?",
    "Would you relocate for love?",
    "What's your philosophy in life?",
    "When do you think a person is ready for marriage?",
    "What accomplishment are you most proud of?",
    "What's your favorite hobby to do alone?",
    "Did you ever write a journal?",
    "Is what you're doing now what you always wanted to do growing up?",
    "What did your past relationship teach you?",
    "What are your thoughts on online dating or tinder?",
    "Which parent are you closer to and why?",
    "What was the best phase in your life?",
    "What are three things you value most about a person?",
    "Who are five people you are closest with?",
    "Do you believe in second chances?",
    "Who is that one person you can talk to about just anything?",
    "Have you ever lost someone close to you?",
    "If you are in a bad mood, do you prefer to be left alone or have someone to cheer you up?",
    "What's the most exciting thing that's happened this past year?",
    "When have you felt your biggest adrenaline rush?",
    "What is your idea of a perfect vacation?",
    "What's one thing that bothers you most about the world today?",
    "Are you religious or spiritual?",
    "Would you ever take back someone who cheated?",
    "What is the greatest struggle you've overcome?",
    "Do you consider yourself an introvert or an extrovert?",
    "What's your favorite book/movie of all time and why did it speak to you so much?",
    "Are you more into looks or brains?",
    "What's the one thing you would like to change about yourself?",
    "What would you do if you found out you were adopted?",
    "What if you found out that you were the star of the Truman Show?",
    "What is a relationship deal breaker for you?",
    "What are you most thankful for?",
    "Do you ever sing in the shower?",
    "What is the worst piece of advice you've ever gotten?",
    "What's the most embarrassing thing that's happened to you recently?",
    "Tell me about the worst pickup line you've ever gotten.",
    "What is your favorite celebrity scandal right now?",
    "What's the worst thing you've ever worn?",
    "If you could do anything illegal without getting in trouble, what would it be?",
    "What is the stupidest joke you've ever heard?",
    "When was the last time you laughed so hard you cried?",
    "What's the best prank you've ever played on someone?",
    "What do you think is the funniest movie ever?",
    "What always makes you laugh, even when you're upset?",
    "Who is your favorite comedian?",
    "What weird conspiracy theory do you believe?",
    "Is a hot dog a sandwich?",
    "Which celebrity would play you in a movie about your life?",
    "What's the weirdest thing you loved as a child?",
    "What is something that's really popular right now that will be ridiculous in five years?",
    "What's the worst trend you've ever taken part in?",
    "What's your go-to joke?"
]