[
    "I've got a really good UDP joke to tell you but I don’t know if you'll get it.",
    "How many programmers does it take to screw in a light bulb?\nNone. It's a hardware problem.",
    "A guy walks into a bar and asks for 1.4 root beers.\nThe bartender says \"I'll have to charge you extra, that's a root beer float\".\nThe guy says \"In that case, better make it a double.\"",
    "A programmer puts two glasses on his bedside table before going to sleep.\nA full one, in case he gets thirsty, and an empty one, in case he doesn't.",
    "Java and C were telling jokes. It was C's turn, so he writes something on the wall, points to it and says \"Do you get the reference?\" But Java didn't.",
    "A SQL statement walks into a bar and sees two tables.\nIt approaches, and asks \"may I join you?\"",
    "Why did the web developer walk out of a resturant in disgust?\nThe seating was laid out in tables.",
    "Why is 6 afraid of 7 in hexadecimal Canada?\nBecause 7 8 9 A?",
    "Programming is like sex.\bMake one mistake and you end up supporting it for the rest of your life.",
    "Your mama's so FAT she can't save files bigger than 4GB.",
    "Hey, wanna hear a joke?\nParsing HTML with regex.",
    "Why do programmers confuse Halloween and Christmas?\nBecause Oct 31 = Dec 25",
    "// This line doesn't actually do anything, but the code stops working when I delete it.",
    "Why does no one like SQLrillex?\nHe keeps dropping the database.",
    "What do you call a developer who doesn't comment code?\nA developer.",
    "Why did the Python programmer not respond to the foreign mails he got?\nBecause his interpreter was busy collecting garbage.",
    "Why did the programmer quit his job?\nBecause he didn't get arrays.",
    "How can you tell an extroverted programmer?\nHe looks at YOUR shoes when he's talking.",
    "\"Honey, go to the store and buy some eggs.\"\n\"OK.\"\n\"Oh and while you're there, get some milk.\"\nHe never returned.",
    "How do you know God is a shitty programmer?\nHe wrote the OS for an entire universe, but didn't leave a single useful comment.",
    "\"We messed up the keming again guys.\"",
    "Why are modern programming languages so materialistic?\nBecause they are object-oriented.",
    "If Bill Gates had a dime for every time Windows crashed ... Oh wait, he does.",
    "The glass is neither half-full nor half-empty, the glass is twice as big as it needs to be.",
    "A byte walks into a bar looking miserable.\nThe bartender asks it: \"What's wrong buddy?\"\n\"Parity error.\" it replies. \n\"Ah that makes sense, I thought you looked a bit off.\"",
    "ASCII silly question, get a silly ANSI.\nA regular expression.",
    "Java is like Alzheimer's, it starts off slow, but eventually, your memory is gone.",
    "Two C strings walk into a bar.\nThe bartender asks \"What can I get ya?\"\nThe first string says \"I'll have a gin and tonic.\"\nThe second string thinks for a minute, then says \"I'll take a tequila sunriseJF()#$JF(#)$(@J#()$@#())!*FNIN!OBN134ufh1ui34hf9813f8h8384h981h3984h5F!##@\"\nThe first string apologizes, \"You'll have to excuse my friend, he's not null-terminated.\"",
    "What do you call a group of 8 Hobbits?\nA Hobbyte.",
    "Saying that Java is nice because it works on every OS is like saying that anal sex is nice because it works on every gender.",
    "Why did the JavaScript heap close shop?\nIt ran out of memory.",
    "What is the best prefix for global variables?\n//",
    "Today I learned that changing random stuff until your program works is \"hacky\" and a \"bad coding practice\" but if you do it fast enough it's \"Machine Learning\" and pays 4x your current salary.",
    "Eight bytes walk into a bar.\nThe bartender asks, \"Can I get you anything?\"\n\"Yeah,\" reply the bytes.\n\"Make us a double.\"",
    "There are only 10 kinds of people in this world: those who know binary and those who don't.",
    "\"Knock, knock.\"\n\"Who's there?\"\n\n[very long pause]\n\n\"Java.\"",
    "Programming is 10% science, 20% ingenuity, and 70% getting the ingenuity to work with the science.",
    "A man is smoking a cigarette and blowing smoke rings into the air. His girlfriend becomes irritated with the smoke and says \"Can't you see the warning on the cigarette pack? Smoking is hazardous to your health!\" to which the man replies, \"I am a programmer.  We don't worry about warnings; we only worry about errors.\"",
    "The generation of random numbers is too important to be left to chance.",
    "Debugging: Removing the needles from the haystack.",
    "Hey Girl,\nRoses are #ff0000,\nViolets are #0000ff,\nI use hex codes,\nBut I'd use RGB for you.",
    "Debugging is like being the detective in a crime movie where you're also the murderer at the same time.",
    "How do you tell HTML from HTML5?\n- Try it out in Internet Explorer\n- Did it work?\n- No?\n- It's HTML5.",
    "Have a great weekend!\nI hope your code behaves the same on Monday as it did on Friday.",
    "Judge: \"I sentence you to the maximum punishment...\"\nMe (thinking): \"Please be death, please be death...\"\nJudge: \"Learn Java!\"\nMe: \"Damn.\"",
    "What's the object-oriented way to become wealthy?\nInheritance.",
    "Why did the functional programmer get thrown out of school?\nBecause he refused to take classes.",
    ".NET developers are picky when it comes to food.\nThey only like chicken NuGet.",
    "Why do programmers wear glasses?\nBecause they need to C#",
    "Algorithm: A word used by programmers when they don't want to explain how their code works.",
    "So what's a set of predefined steps the government might take to preserve the environment?\nAn Al-Gore-ithm.",
    "Why do Java programmers hate communism?\nThey don't want to live in a classless society.",
    "Hey baby I wish your name was asynchronous...\n... so you'd give me a callback.",
    "Your momma is so fat, you need to switch to NTFS to store a picture of her.",
    "What is a dying programmer's last program?\nGoodbye, world!",
    "\"Can I tell you a TCP joke?\"\n\"Please tell me a TCP joke.\"\n\"OK, I'll tell you a TCP joke.\"",
    "The six stages of debugging:\n1. That can't happen.\n2. That doesn't happen on my machine.\n3. That shouldn't happen.\n4. Why does that happen?\n5. Oh, I see.\n6. How did that ever work?",
    "How do you generate a random string?\nPut a Windows user in front of Vim and tell them to exit.",
    "Four engineers get into a car. The car won't start.\nThe Mechanical engineer says \"It's a broken starter\".\nThe Electrical engineer says \"Dead battery\".\nThe Chemical engineer says \"Impurities in the gasoline\".\nThe IT engineer says \"Hey guys, I have an idea: How about we all get out of the car and get back in\".",
    "How did you make your friend rage?\nI implemented a greek question mark in his JavaScript code.",
    "Knock knock.\nWho's there?\nRecursion.\nRecursion who?\nKnock knock.",
    "Being a self-taught developer is almost the same as being a cut neck chicken because you have no sense of direction in the beginning.",
    "What is the most used language in programming?\nProfanity.",
    "What are bits?\nTiny things left when you drop your computer down the stairs.",
    "Why did the programmer jump on the table?\nBecause debug was on his screen.",
    "Two SQL tables sit at the bar. A query approaches and asks \"Can I join you?\"",
    "Why do they call it hyper terminal?\nToo much Java.",
    "Why do programmers prefer using the dark mode?\nBecause light attracts bugs.",
    "Why did the Python data scientist get arrested at customs?\nShe was caught trying to import pandas!",
    "UDP is better in the COVID era since it avoids unnecessary handshakes.",
    "Why is Linux safe?\nHackers peak through Windows only.",
    "Why are Assembly programmers always soaking wet?\nThey work below C-level.",
    "Why did the database administrator leave his wife?\nShe had one-to-many relationships.",
    "How did the programmer die in the shower?\nHe read the shampoo bottle instructions: Lather. Rinse. Repeat.",
    "Why was the Javascript developer sad?\nBecause they didn't Node how to Express themself.",
    "why do python programmers wear glasses?\nBecause they can't C.",
    "I have a joke about Stack Overflow, but you would say it's a duplicate.",
    "Documentation is like sex:\nWhen it's good, it's very good.\nWhen it's bad, it's better than nothing...",
    "One day, a mechanical engineer, electrical engineer, chemical engineer, and computer engineer were driving down the street in the same car when it broke down.The mechanical engineer said, \"I think a rod broke.\"The chemical engineer said, \"The way it sputtered at the end, I think it's not getting enough gas.\"The electrical engineer said, \"I think there was a spark and something's wrong with the electrical system.\"All three turned to the computer engineer and said, \"What do you think?\"The computer engineer said, \"I think we should all get out and then get back in.\"",
    "At a recent computer expo (1996 COMDEX), Bill Gates compared the computer industry to the automotive indusrty by stating: \"If GM had kept up with technology like the computer industry has, we would all be driving cars that cost $25.00 and get 1,00 miles to the gallon.\"\n\nIn response to Bills comment, General Motors issued A press release making the following statement: \"If we (GM) had kept up with technology like the computer industry has, we would all be driving cars with the following characteristics:\n\n1) for no reson whatsoever, your car would crash twice per day.\n2) Every time they repainted the lines in the road, you would have to buy a new car.\n3) Your car would occasionally stop on the freeway without reason. In order to get started again, you would have to pull off to the side of the road, close all the windowsshut off the car resart it and open all the windows again. For some unknown reason, you would simply do this without question.\n4) Occasionally, executing a maneuver, such as a left turn, would cause your car to shut down and refuse to resart, in which case you would have to reinstall the engine.\n5) Only one person could use the car at one time unless you bought \"Car95\" or \"CarNT\", but then you would also have to buy more seats.\n6) The new seats you would need would force everyone to have the same size butt.\n7) You would press the \"start\" button to shut off the engine.\n8) The oil warning light, water warning light, and alternator warning light would all be replaced by a single \"Unidentified System Error\" light.\n9) The air bag would ask ur freshly mangled body \"are you sure\" before going off.\n10) Occasionally, for no reason whatsoever, your car would lock you out and refuse to let you back inuntill you simultaneously lifted the driver side door handle, turned the key, and grabbed the radio antenna.\n11) The radio antenna would be internally mounted on the passenger side of the car.\n12) buying a new car would force you to also purchase a new set of Deluxe Rand McNally road maps, dispite the fact that you niether need nor want them. Attempting to delet this otion would immediately cause your cars performance to diminish by 50% or more.\n13) every time GM introduced a new car, people would have to learn to drive all over again because none of the old controls would function in the new car.\n14) Macintosh would make a car that was five times faster, ten times more reliable and easier to mantain, twice as easy to drive, but would only run on five percent of the roads.\"",
    "Reaching the end of a job interview, the human resources person asked a young engineer fresh out of MIT, \"And what starting salary were you looking for?\"The engineer said, \"In the neighborhood of $125,000 a year, depending on the benefits package.\" The interviewer said, \"Well, what would you say to a five-week vacation, 14 paid holidays, full medical and dental, company matching your retirement fund to 50% of your salary, and a company car leased every two years, say, a red Corvette?\"The young engineer sat up straight and said, \"Wow! Are you kidding?\"The interviewer replied, \"Yeah, but you started it.\"",
    "Since AOL has introduce there unlimited hours package they have started displaying special messages to customers. \n\n1. You have been on-line for 46 minutes. Do you want to stay on-line? Please respond within 10 minutes, or you will be logged off. \n\n2. You have been on-line 135 minutes. Not to put any pressure on you, but there are OTHER people in the world who would like to sign on. Let's show some consideration for our fellow members and sign off, WHADDYA SAY? \n\n3. You DO realize that you have been on-line for 180 minutes, right? When was the last time you went outside? \n\n4. OK, this is getting ridiculous. Frankly, you're starting to upset us! If you sign off now, we'll bring back your buddy list, OK? \n\n5. You have been on-line for 360 minutes now! We promised you unlimited time, we know, but can't you just finish up and go read a good book?! \n\n6. You have been on-line for 467 minutes. Do you remember your family members names? \n\n7. You have been on-line for 513 minutes. Your spouse has left and your dog is starving. Do you wish to remain on-line? \n\n8. You have been on-line for 724 minutes. Steve Case is coming personally to your house to yank the phone cord! \n\n9. You have been on-line for 852 minutes. Do you KNOW how many hours that is? \n\n10. You have been on-line for 921 minutes. Do you realize that AOL averages 921 complaints per hour about busy phone lines? Do you realize that AOL receives 9.21 lawsuits per day, due to busy phone lines? PLEASE sign-off, to reduce these averages, or go to KEYWORD: Class Action to join a lawsuit. \n\n11. You have been on-line for 967 minutes. When AOL went unlimited, they didn't think you would take it LITERALLY! So get OFF, before we go broke! \n\n12. You have been on-line for 1013 minutes. This is Steve Case, I need to sign-on myself and answer some mail. Could you PLEASE sign-off? \n\n13. You have been on-line for 1105 minutes. Are you and your family chatting in shifts? GEEZE get off already! \n\n14. You have been on-line 1151 minutes. WELCOME TO THE TEAM... See job application enclosed!",
    "An application was for employment \nA program was a TV show \nA cursor used profanity \nA keyboard was a piano! \n\nMemory was something that you lost with age \nA CD was a bank account \nAnd if you had a 3 1/2 inch floppy \nYou hoped nobody found out! \n\nCompress was something you did to garbage \nNot something you did to a file \nAnd if you unzipped anything in public \nYou'd be in jail for a while! \n\nLog on was adding wood to a fire \nHard drive was a long trip on the road \nA mouse pad was where a mouse lived \nAnd a backup happened to your commode! \n\nCut - you did with a pocket knife \nPaste you did with glue \nA web was a spider's home \nAnd a virus was the flu! \n\nI guess I'll stick to my pad and paper \nAnd the memory in my head \nI hear nobody's been killed in a computer crash \nBut when it happens they wish they were dead!",
    "This memo is to announce the development of a new software system which will be Year 2000 compliant. This program is known as \"Millennia Year Application Software System\" (MYASS). \nNext Monday there will be a meeting in which I will show MYASS to everyone. We will hold demonstrations throughout the month so that all employees will have an opportunity to get a good look at MYASS. We have not addressed networking aspects yet, so currently only one person at a time can use MYASS. This restriction will be removed after MYASS expands. \n\nSome employees have begun using the program already. This morning I walked into a subordinate's office and was not surprised to find that he had his nose buried in MYASS. Some of the less technical people may be somewhat afraid of MYASS. Last week my secretary said to me, \"I'm a little nervous, I never put anything in MYASS before.\" I helped her through the first time and afterward she admitted that it was relatively painless and she was actually looking forward to doing it again, and was even ready to kiss MYASS. \n\nThere have been concerns over the virus that was found in MYASS upon initial installation, but the virus has been eliminated and we were able to save MYASS. In the future, however, protection will be required prior to entering MYASS. This database will encompass all information associated with the business. \n\nAs you begin using the program, feel free to put anything you want in MYASS. As MYASS grows larger, we envision a time when it will be commonplace for a supervisor to hand work to an employee and say, \"here, stick this in MYASS.\" It will be a great day when we need data quickly and our employees can respond, \"Here it is, I just pulled it out of MYASS.\"",
    "Computer genderA marketing director for a prominent computer manufacturer was devising a new advertising campaign for his company. While researching consumer response to his product, he asked \"Naval ships are commonly referred to as 'she' or 'her'. What gender would you assign to your computer? Give four reasons to support your answer...\"A large group of women reported that the computers should be referred to in the masculine gender because:1. In order to get their attention, you have to turn them on.2. They have a lot of data, but are still clueless.3. They are supposed to help you solve problems, but half the time they are the problem.4. As soon as you commit to one, you realize that, if you had waited a little longer you could have had a better model.The men, on the other hand, concluded that computers should be referred to in the feminine gender because:1. No one but the Creator understands their internal logic.2. The native language they use to communicate with other computers is incomprehensible to everyone else.3. Even your smallest mistakes are stored in long-term memory for later retrieval.4. As soon as you make a commitment to one, you find yourself spending half your paycheck on accessories for it.",
    "Customer: \"I'm running Windows '95.\"Tech Support: \"Yes.\"Customer: \"My computer isn't working now.\"Tech Support: \"Yes, you said that.\"",
    "DR. SEUSS EXPLAINS COMPUTERSIf a packet hits a pocket on a socket on a port, and the bus is interrupted as a very last resort, and the address of the memory makes your floppy disk abort, then the socket packet pocket has an error to report.If your cursor finds a menu item followed by a dash, and the double-clicking icon puts your window in the trash, and your data is corrupted 'cause the index doesn't hash, then your situation's hopeless and your system's gonna crash!If the label on the cable on the table at your house, says the network is connected to the button on your mouse, but your packets want to tunnel on another protocol, that's repeatedly rejected by the printer down the hall, and your screen is all distorted by the side effects of gauss, so your icons in the window are as wavy as a souse, then you may as well reboot and go out with a bang, 'cause as sure as I'm a poet, the sucker's gonna hang!When the copy of your floppy's getting sloppy on the disk, and the microcode instructions cause unnecessary risk, then you have to flash your memory and you'll want to RAM your ROM.Quickly turn off the computer. . . . and be sure to tell your mom.",
    "IF OPERATING SYSTEMS WERE THE AIRLINES UNIX Airways  Everyone brings one piece of the plane along when they come  to the airport.They all go out on the runway and put the  plane together piece by piece, arguing non-stop about what  kind of plane they are supposed to be building. Air DOS  Everybody pushes the airplane until it glides, then they jump  on and let the plane coast until it hits the ground again.  Then they push again, jump on again, and so on ... Mac Airlines  All the stewards, captains, baggage handlers, and ticket agents  look and act exactly the same. Every time you ask questions  about details, you are gently but firmly told that you don't  need to know, don't want to know, and everything will be done  for you without your ever having to know, so just shut up. Windows Air  The terminal is pretty and colorful, with friendly stewards,  easy baggage check and boarding, and a smooth take-off.After  about 10 minutes in the air, the plane explodes with no warning  whatsoever. Windows NT Air  Just like Windows Air, but costs more, uses much bigger planes,  and takes out all the other aircraft within a 40-mile radius  when it explodes. Linux Air  Disgruntled employees of all the other OS airlines decide to  start their own airline.They build the planes, ticket counters,  and pave the runways themselves.They charge a small fee to  cover the cost of printing the ticket, but you can also download  and print the ticket yourself.When you board the plane, you  are given a seat, four bolts, a wrench and a copy of the  seat-HOWTO.html.Once settled, the fully adjustable seat is  very comfortable, the plane leaves and arrives on time without  a single problem, the in-flight meal is wonderful.You try to  tell customers of the other airlines about the great trip, but  all they can say is, \"You had to do what with the seat?\"",
    "The businessman dragged himself home and barely made it to his chair before he dropped exhausted.His sympathetic wife was right there with a tall cool drink and a comforting word. \"My, you look tired,\" she said. \"You must have had a hard day today. What happened to make you so exhausted?\"\"It was terrible,\" her husband said. \"The computer broke down and all of us had to do our own thinking.\"",
    "Staff NoticeWith immediate effect, a toilet policy will be established to provide a more consistent method of accounting for staff, ensuring effective time management and equal treatment for all. On the first day of every month, all staff will be issued 20 toilet trip credits which may be accumulated.The doors to all toilets will be equipped with computer-linked voice recognition devices. Staff must immediately provide management with two voiceprints, one normal and one under stress. Once the employee's toilet trip bank reaches zero, the doors of the toilet will not unlock for the employee's voice until the first of the month.In addition, all cubicles are to be equipped with timed paper-roll extractors. If the toilet is occupied for more than three minutes, an alarm will sound. Thirty seconds later, the roll of toilet paper will retract into the dispenser, the toilet will flush and the door will open automatically. If the toilet remains occupied, your photograph will be taken by a security camera and will appear on the Toilet Offenders Board. Anyone appearing three times will forfeit three months' toilet trip credits. Anyone caught smiling when the photograph is taken will undergo counseling by a clinical psychologist.Be advised that workmen's compensation insurance does not cover any injuries incurred while trying to stop the toilet paper retracting into the dispenser.MANAGEMENT",
    "A man goes to his doctor complaining of bad headaches.His doctor says, \"We just got this new machine.You take a urine sample and feed it into the machine, and it tells you everything that is wrong with you.\"\nThinking this is pretty amazing, the man gives a sample and the doctor feeds it into the machine.It spits out a piece of paper, which the doctor reads.\"According to this, you have tennis elbow.\"\n\"But there's nothing wrong with my elbow,\" the man replies. \"It's my head\".\nThe doctor gives him a specimen cup and tells him to bring in a new sample the next day, and they will try again.\nWhen he gets home, the man is angry and thinks to himself, \"I'll show that doctor.\"\nSo he takes the dipstick from his car and puts some oil in the cup.When his wife and daughter get home, he has each of them urinate in the cup, then he finishes by \nThe next day he goes back to the doctor and hands him the specimen.The doctor feeds it into the machine, then reads the printout.\n\"Well, what does it say?\", the man asks,laughing.\n\"According to this,\"the doctor replies,\"your car needs an oil change, your wife has crabs, your daughter is pregnant, and your tennis elbow won't get better if you keep",
    "\"This little computer,\" said the sales clerk, \"will do half of your job for you. \"Studying the machine, the senior VP said, \"Fine, I'll take two. \"",
    ">A tech support employee once received a call from a disgruntled lady who had purchase one of their PCs. \"The cup holder on my computer broke!I just got some coffee and put it in the cup holder and then it broke, and the coffee spilled all over me! I want a replacement!\"The employee was a little confused and didn't know what to say. He finally asked her to describe the cup holder to him. . . he'd never heard of his company selling in-computer cup holders. So the lady went on to describe the cup holder to him. \"Well, it pops out of the little box when I push a button, and it has 40x written on it. . . \"",
    "Bill Gates wanted to look good and impress everyone with his success. He decided to measure the accomplishments of Microsoft against General Motors. The comparison went like this: If automotive technology had kept pace with computer technology over the past few decades, you would now be driving a V-32 instead of a V-8, and it would have a top speed of 10,000 miles per hour. (160,000km/hr) Or you could have an economy car that weighs 30 pounds (14 kilos) and getsa thousand miles to a gallon of gas. In either case the sticker price of a new car would be less than $50. In response to all this goading, GM responds: \"Yes, but would you really want to drive a car that crashes four times a day?\"",
    "Jesus SavesJesus and Satan were having an ongoing argument about who was better on his computer. They had been going at it for days, and God was tired of hearing all of the bickering. Finally God said, \"Cool it. I am going to set up a test that will run two hours and I will judge who does the better job.\" So down Satan and Jesus sat at the keyboards and typed away.They did spreadsheets. They wrote reports. They sent faxes. They sent e-mail.They downloaded. They did some genealogy reports. They made cards. They did every known job. About ten minutes before their time was up, lightning flashed across the sky, thunder rolled, the rain poured, and, of course, the electricity went off. Satan stared at his blank screen and screamed every curse word known in the underworld. Jesus just sighed. The electricity finally flickered back on, and each of them rebooted their computers. Satan started searching frantically, screaming \"It's gone! It's all gone! I lost everything when the power went out!\" Meanwhile, Jesus quietly started printing out all of his files from the past two hours. Satan observed this and became very irate: \"Wait! He must have cheated. How did he do that?\"God shrugged and said, \"Jesus saves.\"",
    "Jesus and Satan were having an ongoing argumentabout who was better on his computer. They had been going atit for days, and God was tired of hearing all of thebickering.Finally God said, \"Cool it. I am going to set up atest that will run two hours and I will judge who doesthe better job.\"So down Satan and Jesus sat at the keyboards andtyped away.They did spreadsheets. They wrote reports.They sent faxes. They sent e-mail.They downloaded. Theydid some genealogy reports. They made cards. They did everyknown job. About ten minutes before their time was up,lightning flashed across the sky, thunder rolled, the rainpoured, and, of course, the electricity went off. Satanstared at his blank screen and screamed every curse wordknown in the underworld. Jesus just sighed.The electricity finally flickered back on, and each of themrebooted their computers. Satan started searchingfrantically, screaming \"It's gone! It's all gone! I losteverything when the power went out!\"Meanwhile, Jesus quietly started printing out allof his files from the past two hours. Satan observed thisand became very irate: \"Wait! He must have cheated.How did he do that?\"God shrugged and said, \"Jesus saves.\"",
    "Signs You Are \"Webbed Out\" From Using The Web: Your opening line is, \"So what's your home page address?Your best friend is someone you've never met.You see a beautiful sunset and you expect to see \"Enhanced for IE 5.5\" on the clouds.You are overcome with disbelief, anger and finally depressed when you encounter a Web page with no links.You feel driven to consult the \"Cool Page of the Day\" on your wedding day.You are driving on a dark and rainy night when you hydroplane on a puddle, sending your car careening toward a flimsy guard rail that separates you from the precipice of a rocky cliff and certain death. You frantically search for the \"Back\" button.You visit \"The Really Big Button that doesn't do Anything\" again and again and again.Your dog has his own Web page.So does your goldfish.When you read a magazine, you have an irresistible urge to click on the underlined passages.You find yourself typing \"com\" after every period when using a word processor.comYou turn off your modem and get this awful empty feeling, like you just pulled the plug on a loved one.You start introducing yourself as \"Jon at I-I Net dot com\"Your wife drapes a blond wig over your monitor to remind you of what she looks like.All of your friends have an @ in their names.You can't call your mother...she doesn't have a modem.Your phone bill comes to your doorstep in a box.You laugh at people with 2400 baud modems.You move into a new house and decide to Netscape before you landscape.You refer to going to the bathroom as downloading.You tell the cab driver you live at http://123.elm.street/house/bluetrim.htmlYour spouse makes a new rule: \"The computer cannot come to bed.\"You ask a plumber how much it would cost to replace the chair in front of your computer with a commode.You start tilting your head sideways to smile. :^)You turn on your computer, and turn off your spouse.Your spouse says communication is important in a marriage...so you buy another computer, and install a second phone line so the two of you can chat.You begin to wonder how on earth your service provider is allowed to call 200 hours per month \"unlimited.\"",
    "Top 20 reasons dogs don't use computers: 20) Can't stick their heads out of Windows '95.19) Fetch command not available on all platforms.18) Hard to read the monitor with your head cocked to one side.17) Too difficult to \"mark\" every website they visit.16) Can't help attacking the screen when they hear \"You've Got Mail.\"15) Fire hydrant icon simply frustrating.14) Involuntary tail wagging is dead giveaway they're browsing www.pethouse.com instead of working.13) Keep bruising noses trying to catch that MPEG frisbee.12) Not at all fooled by Chuckwagon Screen Saver.11) Still trying to come up with an \"emoticon\" that signifies tail-wagging.10) Waiting for the introduction of the Microsoft Opposable Thumb.9) Three words: Carpal Paw Syndrome8) 'Cause dogs ain't GEEKS! Now, cats, on the other hand...7) Barking in next cube keeps activating YOUR voice recognition software.6) SmellU-SmellMe still in beta test.5) SIT and STAY were hard enough, GREP and AWK are out of the question!4) Saliva-coated mouse gets mighty difficult to maneuver.3) Annoyed by lack of newsgroup, alt.pictures.master's.leg.2) Butt-sniffing more direct and less deceiving than online chat rooms.1) TrO{ HyAqR4tDc TgrOo TgYPmE WeIjTyH PAzWqS,.",
    "While my brother-in-law was tapping away on his home computer, his ten-year-old daughter sneaked up behind him. Then she turned and ran into the kitchen, squealing to the rest of the family, \"I know Daddy's password! I know Daddy's password!\" \"What is it? her sisters asked eagerly. Proudly she replied, \"Asterisk, asterisk, asterisk, asterisk, asterisk!\"",
    "A man goes into a pet shop to buy a parrot. The shop owner points to three identical looking parrots on a perch and says:\"The parrot to the left costs 500 dollars\".\"Why does the parrot cost so much?\" the customer asks.The owner says, \"Well, it knows how to use a computer.\"The customer asks about the next parrot and is told \"That one costs 1,000 dollars because it can do everything the other parrot can do plus it knows how to use the UNIX operating system.\"Naturally, the increasingly startled man asks about the third parrot and is told \"That one costs 2,000 dollars.\"Needless to say this begs the question \"What can IT do?\"To which the owner replies \"To be honest I've never seen it do a thing but the other two call him boss!\"",
    "In March 1992 a man living in Newton near Boston Massachusetts received a bill for his as yet unused credit card stating that he owed $0.00. He ignored it and threw it away. In April he received another and threw that one away too. The following month the credit card company sent him a very nasty note stating they were going to cancel his card if he didn't send them $0.00 by return of post. He called them, talked to them, they said it was a computer error and told him they'd take care of it. The following month he decided that it was about time that he tried out the troublesome credit card figuring that if there were purchases on his account it would put an end to his ridiculous predicament. However, in the first store that he produced his credit card in payment for his purchases he found that his card had been canceled. He called the credit card company who apologized for the computer error once again and said that they would take care of it. The next day he got a bill for $0.00 stating that payment was now overdue. Assuming that having spoken to the credit card company only the previous day the latest bill was yet another mistake he ignored it, trusting that the company would be as good as their word and sort the problem out. The next month he got a bill for $0.00 stating that he had 10 days to pay his account or the company would have to take steps to recover the debt. Finally giving in, he thought he would play the company at their own game and mailed them a check for $0.00. The computer duly processed his account and returned a statement to the effect that he now owed the credit card company nothing at all. A week later, the man's bank called him asking him what he was doing writing a check for $0.00. After a lengthy explanation the bank replied that the $0.00 check had caused their check processing software to fail. The bank could not now process ANY checks from ANY of their customers that day because the check for $0.00 was causing the computer to crash. The following month the man received a letter from the credit card company claiming that his check had bounced and that he now owed them $0.00 and unless he sent a check by return of post they would be taking steps to recover the debt. The man, who had been considering buying his wife a computer for her birthday, bought her a typewriter instead.",
    "A lawyer and a blonde are sitting next to each other on a long flight from LA to NY. The lawyer leans over to her and asks if she would like to play a fun game. The blonde just wants to take a nap, so she politely declines and rolls over to the window to catch a few winks. The lawyer persists and explains that the game is really easy and a lot of fun. He explains: \"I ask you a question, and if you don't know the answer, you pay me $5, and visa-versa.\" Again, she politely declines and tries to get some sleep. The lawyer, now somewhat agitated, says, \"Okay, if you don't know the answer you pay me $5, and if I don't know the answer, I will pay you $50\" figuring that since she is a blonde that he will easily win the match. This catches the blonde's attention and, figuring that there will be no end to this torment unless she plays, she agrees to the game. The lawyer asks the first question: \"What's the distance from the earth to the moon?\" The blonde doesn't say a word, reaches into her purse, pulls out a five-dollar bill and hands it to the lawyer. Now, it's the blonde's turn. She asks the lawyer: \"What goes up a hill with three legs, and comes down with four?\" The lawyer looks at her with a puzzled look. He takes out his laptop computer and searches all his references. He taps into the digital cellphone via infra-red wireless connection to his modem port and searches the Net and the Library of Congress. Frustrated, he sends E-mail to all his co-workers, friends, clients, and suppliers that he knows. And then some. All to no avail. After over an hour, he wakes the blonde and hands her $50. The blonde politely takes the $50 and turns away to get back to sleep. The lawyer, who is more than a little miffed, wakes the blonde and asks, \"Well, so what IS the answer?\" Without a word, the blonde reaches into her purse, hands the lawyer $5, and goes back to sleep.",
    "A man goes into a pet shop to buy a parrot. The shop owner points to three identical looking parrots on a perch and says:\"The parrot to the left costs 500 dollars\".\"Why does the parrot cost so much?\" the customer asks.The owner says, \"Well, it knows how to use a computer.\"The customer asks about the next parrot and is told \"That one costs 1,000 dollars because it can do everything the other parrot can do plus it knows how to use the UNIX operating system.\"Naturally, the increasingly startled man asks about the third parrot and is told \"That one costs 2,000 dollars.\"Needless to say this begs the question \"What can IT do?\"To which the owner replies \"To be honest I have never seen it do a thing but the other two call him boss!\"",
    "How do you know if a blond has used a computer?A:if there's white out on the screen.",
    "1. Your stationery is more cluttered than Warren Beatty's address book. The letterhead lists a fax number, e-mail addresses for two on-line services, and your Internet address, which spreads across the breadth of the letterhead and continues to the back. In essence, you have conceded that the first page of any letter you write *is* letterhead.\n\n2. You can no longer sit through an entire movie without having at least one device on your body beep or buzz.\n\n3. You need to fill out a form that must be typewritten, but you can't because there isn't one typewriter in your house only computers with laser printers.\n\n4. You think of the gadgets in your office as \"friends,\" but you forget to send your father a birthday card.\n\n5. You disdain people who use low Baud rates.\n\n6. When you go into a computer store, you eavesdrop on a salesperson talking with customers and you butt in to correct him and spend the next twenty minutes answering the customers' questions, while the salesperson stands by silently, nodding his head.\n\n7. You use the phrase \"digital compression\" in a conversation without thinking how strange your mouth feels when you say it.\n\n8. You constantly find yourself in groups of people to whom you say the phrase \"digital compression.\" Everyone understands what you mean, and you are not surprised or disappointed that you don't have to explain it.\n\n9. You know bill Gates' e-mail address, but you have to look up your own social security number.\n\n10. You stop saying \"phone number\" and replace it with \"voice number,\" since we all know the majority of phone lines in any house are plugged into contraptions that talk to other contraptions.\n\n11. You sign Christmas cards by putting :) next to your signature.\n\n12. Off the top of your head, you can think of nineteen keystroke symbols that are far more clever than :).\n\n13. You back up your data every day.\n\n14. Your wife asks you to pick up some minipads for her at the store and you return with a wrist-rest for her mouse.\n\n15. You think jokes about being unable to program a VCR are stupid.\n\n16. On vacation, you are reading a computer manual and turning the pages faster than everyone else who is reading John Grisham novels.\n\n17. The thought that a CD could refer to finance or music rarely enters your mind.\n\n18. You are able to argue persuasively that Ross Perot's phrase \"electronic town hall\" makes more sense than the term \"information superhighway,\" but you don't because, after all, the man still uses hand drawn pie charts.\n\n19. You go to computer trade shows and map out your path of the exhibit hall in advance. But you cannot give someone directions to your house without looking up the street names.\n\n20. You would rather get more dots per inch than miles per gallon.\n\n21. You become upset when a person calls you on the phone to sell you something, but you think it's okay for a computer to call and demand that you start pushing buttons on your telephone to receive more information about the product it is selling.\n\n22. You know without a doubt that disks come in five and a quarter and three and a half inch sizes.\n\n23. Al Gore strikes you as an \"intriguing\" fellow.\n\n24. You own a set of itty bitty screwdrivers and you actually know where they are.\n\n25. While contemporaries swap stories about their recent hernia surgeries, you compare mouse induced index finger strain with a nine year old.\n\n26. You are so knowledgeable about technology that you feel secure enough to say \"I don't know\" when someone asks you a technology question instead of feeling compelled to make something up.\n\n27. You rotate your screen savers more frequently than your automobile tires.\n\n28. You have a functioning home copier machine, but every toaster you own turns bread into charcoal.\n\n29. You have ended friendships because of irreconcilably different opinions about which is better the track ball or the track *pad*.\n\n30. You understand all the above jokes. If so, my friend, technology has taken over your life. We suggest, for your own good, that you go lie under a tree and write a haiku. And don't use a laptop.\n\n31. You email these jokes to your friends over the net. You'd never get around to showing it to them in person or reading it to them on the phone. In fact, you have probably never met most of these people face to face.",
    "HOBBIES, TECHNICAL:\n\n\nHOBBIES, NONTECHNICAL:\n\n1992 PRESIDENTIAL ELECTION:\n\n1996 PRESIDENTIAL ELECTION:Technical Thug: Richard Stallman - Larry Wall.",
    "Dear Sir,\n\nI've been having some conflicts between programs lately. I've been running\nthe original version of DrinkingBuddies 1.0 as my primary application and\nall the GirlFriend releases I've tried have always conflicted with it.\nI hear that DrinkingBuddies won't crash if GirlFriend is run in background\nmode and the sound is turned off. But I'm embarrassed to say I can't find\nthe switch to turn the sound off. I just run them separately and it works\nokay. GirlFriend also seems to have a problem co-existing with my Golf\nprogram, often trying to abort Golf with some sort of timing incompatibility.\n\nI probably should have stayed with GirlFriend 1.0, but I thought I might\nsee better performance from GirlFriend 2.0. After months of conflicts and\nother problems, I consulted a friend who has had experience with GirlFriend\n2.0. He said I probably didn't have enough cache to run GirlFriend 2.0,\nand eventually it would require a Token Ring to run properly. He was right\n- as soon as I purged my cache, it uninstalled itself. Shortly after that,\nI installed GirlFriend 3.0 beta. All the bugs were supposed to be gone\nbut the first time I used it, it gave me a virus. I had to clean out my\nwhole system and shut down for a while. I very cautiously upgraded to GirlFriend\n4.0. This time I used a SCSI probe first and also installed a virus protection\nprogram. It worked okay for a while until I discovered that GirlFriend\n1.0 was still in my system. I tried running GirlFriend 1.0 again with GirlFriend\n4.0 still installed, but GirlFriend 4.0 has a feature I didn't know about\nthat automatically senses the presence of any other version of GirlFriend\nand communicates with it in some way, which results in the immediate removal\nof both versions. The version I have now works pretty well, but there are\nstill some problems.\n\nLike all versions of GirlFriend, it is written in some obscure language\nI can't understand, much less reprogram. Frankly, I think there is too\nmuch attention paid to the look and feel rather than the desired functionality.\nAlso, to get the best connections with your hardware, you usually have\nto use gold-plated contacts. And I've never liked how GirlFriend is totally\nobject-oriented.\n\nA year ago, a friend of mine upgraded his version of GirlFriend to GirlFriendPlus\n1.0, which is a Terminate and Stay Resident version of GirlFriend. He discovered\nthat GirlFriendPlus 1.0 expires within a year if you don't upgrade to Fiancé\n1.0. So he did, but soon after that, he had to upgrade to Wife 1.0, which\nhe describes as a huge resource hog. It has taken up all his space so he\ncan't load anything else. One of the primary reasons he decided to go with\nWife 1.0 was because it came bundled with FreeSexPlus. Well, it turns out\nthat the resource allocation module of Wife 1.0 sometimes prohibits access\nto FreeSexPlus, particularly the new Plug-Ins he wanted to try. On top\nof that, Wife 1.0 must be running on a well warmed-up system before he\ncan do anything.\n\nAlthough he did not ask for it, Wife 1.0 also came with MotherInLaw\n1.0 which has an automatic pop-up feature he can't turn off. I told him\nto try installing Mistress 1.0, but he said he'd heard that if you try\nto run it without first uninstalling Wife 1.0, Wife 1.0 will delete MSMoney\nfiles before doing the uninstall itself. Then, Mistress 1.0 won't install\nanyway because of insufficient resources.",
    "Costello calls Abbott with some questions about UNIX\n\nCostello: What is the command that will tell me the revision code of\na program?\n\nAbbott: Yes, that's correct.\n\nCostello: No, what is it?\n\nAbbott: Yes.\n\nCostello: So, which is the one?\n\nAbbott: No. 'which' is used to find the program.\n\nCostello: Stop this. Who are you?\n\nAbbott: Use 'who am i' not 'who r yoo'. You can also 'finger yoo' to\nget information about yoo'.\n\nCostello: All I want to know is what finds the revision code?\n\nAbbott: Use 'what'.\n\nCostello: That's what I am trying to find out. Isn't that true?\n\nAbbott: No. 'true' gives you 0.\n\nCostello: Which one?\n\nAbbott: 'true' gives you 0. 'which is program name'\n\nCostello: Let's get back to my problem. What program? How do I find\nit?\n\nAbbott: Type 'find / -name it -print' to find 'it'. Type 'what program'\nto get the revision code.\n\nCostello: I want to find the revision code.\n\nAbbott: You can't 'find revisioncode', you must use 'what program'.\n\nCostello: Which command will do what I need?\n\nAbbott: No. 'which command' will find 'command'.\n\nCostello: I think I understand. Let me write that.\n\nAbbott: You can 'write that' only if 'that' is a user on your system.\n\nCostello: Write what?\n\nAbbott: No. 'write that'. 'what program'.\n\nCostello: Cut that out!\n\nAbbott: Yes. those are valid files for 'cut'. Don't forget the options.\n\nCostello: Do you always do this?\n\nAbbott: 'du' will give you disk usage.\n\nCostello: HELP!\n\nAbbott: 'help' is only used for Source Code Control System (SCCS).\n\nCostello: You make me angry.\n\nAbbott: No, I don't 'make me' angry but I did 'make programname' when\nI was upset once.\n\nCostello: I don't want to make trouble, so no more.\n\nAbbott: No 'more'? 'which' will help you find 'more'. Every system has\n'more'.\n\nCostello: Nice help! I'm confused more now!\n\nAbbott: Understand that since 'help' is such a small program, it is\nbetter not to 'nice help' and 'more now' is not allowed, but 'at now' is.\nUnless of course 'now' is a file name.\n\nCostello: This is almost as confusing as my PC.\n\nAbbott: I didn't know you needed help with 'pc'. Let me get you to the\nPascal compiler team.",
    "Once upon a midnight dreary, fingers cramped and vision bleary,\nSystem manuals piled high and wasted paper on the floor,\nLonging for the warmth of bed sheets, still I sat there doing spreadsheets.\nHaving reached the bottom line I took a floppy from the drawer,\nI then invoked the SAVE command and waited for the disk to store,\nOnly this and nothing more.\n\nDeep into the monitor peering, long I sat there wond'ring, fearing,\nDoubting, while the disk kept churning, turning yet to churn some more.\nBut the silence was unbroken, and the stillness gave no token.\n\"Save!\" I said, \"You cursed machine!  Save my data from before!\"\nOne thing did the phosphors answer, only this and nothing more,\nJust, \"Abort, Retry, Ignore?\"\n\nWas this some occult illusion, some maniacal intrusion?\nThese were choices undesired, ones I'd never faced before.\nCarefully I weighed the choices as the disk made impish noises.\nThe cursor flashed, insistent, waiting, baiting me to type some more.\nClearly I must press a key, choosing one and nothing more,\nFrom \"Abort, Retry, Ignore?\"\n\nWith fingers pale and trembling, slowly toward the keyboard bending,\nLonging for a happy ending, hoping all would be restored,\nPraying for some guarantee, timidly, I pressed a key.\nBut on the screen there still persisted words appearing as before.\nGhastly grim they blinked and taunted, haunted, as my patience wore,\nSaying \"Abort, Retry, Ignore?\"\n\nI tried to catch the chips off guard, and pressed again, but twice as hard.\nI pleaded with the cursed machine: I begged and cried and then I swore.\nNow in mighty desperation, trying random combinations,\nStill there came the incantation, just as senseless as before.\nCursor blinking, angrily winking, blinking nonsense as before.\nReading, \"Abort, Retry, Ignore?\"\n\nThere I sat, distraught, exhausted, by my own machine accosted.\nGetting up I turned away and paced across the office floor.\nAnd then I saw a dreadful sight: a lightning bolt cut through the night.\nA gasp of horror overtook me, shook me to my very core.\nThe lightning zapped my previous data, lost and gone forevermore.\nNot even, \"Abort, Retry, Ignore?\"\n\nTo this day I do not know, the place to which lost data go.\nWhat demonic nether world us wrought where lost data will be stored,\nBeyond the reach of mortal souls, beyond the ether, into black holes?\nBut sure as there's C, Pascal, Lotus, Ashton-Tate and more,\nYou will one day be left to wander, lost on some Plutonian shore,\nPleading, \"Abort, Retry, Ignore?\"",
    "I'm sure you've heard the old story referring to optimism and pessimism that is determined by whther you think the glass is half-empty or half-full. Here are the reactions when somebody leaves a half glass of milk next to the keyboard.",
    "The \"I Love You\" virus that infects users of Microsoft's outlook has morphed. Watch for these variations:",
    "Disclaimer to be used when purchasing software: \n\nThis check is fully warranted against physical defects and poor workmanship in its stationery. If the check is physically damaged, return it to me and I will replace or repair it at my discretion. No other warranty of any kind is made, neither express nor implied including, but not limited to, the implied warranties of Merchantability, Suitability for Purpose, and Validity of Currency. Any and all risk concerning the actual value of this check is assumed by you, the recipient. Even though I or my agents may have assured you of its worth, either verbally or in written communication, we may have had our fingers crossed, so don't come whimpering back to me if it bounces. \n\nThe money, if any, represented by this instrument remains my property. You are licensed to use it, however you are not allowed to copy the original check except for your personal records, nor are you permitted to give the money itself to anyone else. Neither may you allow any other person to use the money. Remember, you may have it in your possession, but it still belongs to me, and I'm going to call on you from time to time just to keep tabs on it.\n\nThis agreement supersedes all others between us, including the equally ridiculous one you have undoubtedly pasted on the back of your packaging, or concealed somewhere in the middle of it. The location of your version of this or any other covenant between us is irrelevant to its inapplicability here. Only this one pertains, and I really mean it. In fact, this one supersedes yours even though yours may say that it supersedes mine. Why, even if yours said it would supersede mine even if mine said it would supersede yours even if yours said... Oh well. You get the idea.\n\nYou may decline this agreement by returning the uncashed check to me within twenty-four hours. If you attempt to cash it, however, you have implicitly accepted these terms. You may also implicitly accept these terms by:",
    "Judy was having trouble with her computer. So she called Tony, the computer guy, over to her desk. Tony clicked a couple buttons and solved the problem. As he was walking away, Judy called after him, \"So, what was wrong?\"\n\nAnd he replied, \"It was an ID Ten T Error.\"\n\nA puzzled expression ran riot over Judy's face. \"An ID Ten T Error? What's that ... in case I need to fix it again?\"\n\nHe gave her a grin... \"Haven't you ever heard of an ID Ten T Error before?\"\n\n\"No,\" replied Judy.\n\n\"Write it down,\" he said, \"and I think you'll figure it out.\"\n\n(She wrote...) I D 1 0 T",
    "They're know miss steaks in this newsletter cause we used special soft wear witch cheques you're spelling.  It is mower or lass a weigh to verify.  How ever is can knot correct arrows in punctuation ore usage:  an it will not fined words witch are miss used butt spelled rite.  Four example; a paragraph could have mini flaws but wood bee past by the spell checker.  And it wont catch the sentence fragment which you.  Their fore, the massage is that proofreading is knot eliminated, it is still berry much reek wired.",
    "Hello. Yes, you!  You, looking at this screen for hours on end, online.  You,  bleary-eyed.   You, an addict.  Have  you looked in the mirror lately?  Been outside?  Know what  day of the week it is? Your name was given to us by a  spouse  or family member who is concerned about  your  Internet addiction.  At Internetaholics Anonymous, we can  help.  We're a non-profit  society of recovering addicts  like yourself that provides support and counseling through weekly meetings designed to help you cope with your problem.\n\nWe feature a twelve-step recovery program and in extreme  cases, interventions.  Although it is our firm belief that  you are never \"cured,\" you most certainly can recover.\n\nWe have designed a brief checklist to determine IF you are an addict. Do you:",
    "Q: My Etch-A-Sketch has a distorted display.\nA: Pick it up and shake it.\n\nQ: My Etch-A-Sketch has all of these funny little lines all over the\nscreen.\nA: Pick it up and shake it.\n\nQ: How do I turn my Etch-A-Sketch off?\nA: Pick it up and shake it.\n\nQ: What's the shortcut for Undo?\nA: Pick it up and shake it.\n\nQ: How do I create an empty New Document window?\nA: Pick it up and shake it.\n\nQ: How do I Exit without Saving?\nA: Pick it up and shake it.\n\nQ: How do I set the background and foreground to the same color?\nA: Pick it up and shake it.\n\nQ: What is the proper procedure for rebooting my Etch-A-Sketch?\nA: Pick it up and shake it.\n\nQ: How do I delete a document on my Etch-A-Sketch?\nA: Pick it up and shake it.\n\nQ: How do I keep from losing my Etch-A-Sketch documents in the middle\nof my work?\nA: Stop shaking it.",
    "If you  receive an email entitled \"Fighting Canaries,\" delete it immediately. Do not open it. Apparently this one is pretty nasty.\n\nIt will not only erase everything on your hard drive, but it will also delete anything on disks within 20 feet of your computer. It demagnetizes the stripes on all of your credit cards. It reprograms your ATM access code, screws up the tracking on your VCR, and uses subspace field harmonics to scratch any CDs you attempt to play.\n\nIt will recalibrate your refrigerator's coolness settings so all your ice cream melts and your milk freezes. It will program your phone autodial to call only your mother-in-law's  number. This virus will mix antifreeze into your fish tank. It will drink all your sodas. It will leave dirty socks on the coffee table when you are expecting company.\n\nIts radioactive emissions will cause your toe jam and bellybutton fuzz (be honest, you have some) to migrate behind your ears. It will replace your shampoo with Nair and your\nNair with Rogaine, all while dating your current boy/girlfriend behind your back and billing the rendezvous to your Visa card. It will cause you to run with scissors and\nthrow things in a way that is only fun until someone loses an eye. It will give you Dutch Elm Disease and Tinea. It will rewrite your backup files, changing all your active verbs to passive tense and incorporating undetectable misspellings which grossly change the interpretations of key sentences.\n\nIf the message is opened in a Windows 98 environment, it will leave the toilet seat up and leave your hair dryer plugged in dangerously close to a full bathtub. It will not only remove the forbidden tags from your mattresses and pillows, but it will also refill your skim milk with whole milk.\n\nIt will replace all your luncheon meat with Spam. It will molecularly rearrange your cologne or perfume, causing it to smell like dill pickles. It is insidious and subtle. It is dangerous and terrifying to behold.\n\nIt is also a rather interesting shade of mauve. These are just a few signs of infection.",
    "In the beginning, there was chaos and the Universe was without form\nand void. The Lord looked upon His domain and decided to declare His presence.\n\"I be\" he said, then to correct his grammar added \"am.\" If the Lord had\ndecided to work on irregular verb conjugation first, this wouldn't have\nhappened. God would later curse the English language for its part, but\nin that moment IBM came into being. The Lord looked out upon the IBM He\nhad created and said \"This is good.\" That's what He said, but He shook\nhis head, wondered what the boys at the User Group would say, split the\nlight from the dark and went to bed. Thus passed the Beginning and the\nend of the first day.\n\nOn the second day, the Lord summoned IBM unto His presence. \"There is\nchaos out there, and the Universe is without form and void. I must correct\nthis and I can use your help. Is there anything you can do for me?\"\n\n\"I can take care of form,\" IBM replied. \"Put me in charge of computers\nand I will take care of form for you.\"\n\nThe Lord thought that this was good and said \"Let there be computers.\nLet IBM have my powers of creation that pertain to computers and form.\"\nThus saying, the Lord went off to His second day's work while IBM created\nthe 1401.\n\nOn the third day, while the Lord was out, IBM decided to subdivide the\nassgined task. \"Let there be systems that make the computer work and let\nthem be called Operating Systems. Let there also be systems that make use\nof the computer and let them be called Application Systems.\" Thus, there\ncame into being both Operating Systems and Application Systems, but there\nwere no programmers.\n\nThe next morning IBM had to give the Lord a status report.\n\n\"What did you do yesterday?\" the Lord asked.\n\n\"I invented the operating system\" IBM replied.\n\n\"You did?\" the Lord shuddered. \"Oh dear.\"\n\n\"Yes I did,\" IBM confirmed, \"but I find I need something you alone can\nprovide.\"\n\n\"And what is that?\"\n\n\"I need programmers to use my computers, to operate my operating system\nand to apply my applications.\"\n\n\"That can't be done now,\" said the Lord. \"This is only the fourth day\nand there won't be people until the sixth day.\"\n\n\"I need programmers and I need them now. If they can't be people they\ncan't be people, but we have to work this out today.\"\n\n\"Give me some specifications and I'll see what I can do.\" IBM hastily\nworked up specs for programmers (are specs ever anything other than hasty)\nand the Lord reviewed them. The Lord knew the specs weren't sufficient\nbut followed them anyway. He also made some programmers that did just what\nprogrammers were supposed to do, just to spite IBM. The programmers and\nIBM spent the rest of the day creating the Assembler and FORTRAN. On the\nmorning of the fifth day, IBM reported to the Lord once again.\n\n\"The programmers you created for me have a problem. They want a programming\nlanguage that is easy to use and similar to English. I told them you had\ncursed English, though I still don't know why. They wanted me to ask your\nindulgence on this.\"\n\nThe Lord had cursed English for good reason, but didn't want to explain\nthis to IBM. He said \"let there be COBOL\" and that was that.\n\nOn the status report of the next day IBM announced that computers had\ngone forth and multiplied. Unfortunately, the computers still weren't big\nenough or fast enough to do what the programmers wanted. The Lord liked\nthe idea of going forth multiplying, and used the line Himself later on\nthat day. This sixth day being particularly busy, He declared \"Let there\nbe MVS\" and there was MVS.\n\nOn the seventh day God had finished creation and computers had COBOL\nand MVS. The Lord and IBM took the day off to go fishing. IBM hung a sign\non the door to help programmers in his absence.\n\n\nOn the start of the second week the programmers went over IBM's cathode\nray tube directly to God. \"We have a horrible problem,\" they complained.\n\"Our users want systems that perform according to their expectations.\"\n\n\"USERS!\" the Lord bellowed. \"Who said that you should have users! Users\nare the difference between good and bad applications, a function I have\nreserved unto myself! Who authorized you to have users?\"\n\n\"Well, IBM...\"\n\n\"IBM!! You!! You did this to my programmers! You gave them the knowledge\nof good and evil. For that you shall suffer through eternity! Let there\nbe competition. Let it be called Anacom, and Burroughs, and CDC.\" The Lord\nwent through the alphabet several times. \"With all this competition you\nshall still suffer the pain of antitrust legislation all the days of your\nexistence.\"\n\nThis was the start of the second week, and it seems an appropriate place\nto conclude our report. In case you missed something, a summary of key\npoints follows.",
    "Face it, you're gonna have to go outside eventually.  Sure, Amazon.com will deliver right to your door and now even Taco Bell does deliveries, but, mark my words:  some day you're going to HAVE to push away from the computer and go ... OUTSIDE!!!  Here's a guide:",
    "\"Honor System Virus\"\n\nThis virus works on the honor system.\n\nPlease delete all the files on your hard disk, then forward this message to everyone you know.  Thank you for your cooperation.",
    "Q: How many internet mail list subscribers does it take to change a light\nbulb?\nA: 1,331:",
    "Like every other techie, I couldn't wait to get my hands on the just released, state-of-the-art, 64-bit, 128 mega-RAM, 48x, 24/7, in your face, out of your control Microself Windows 2001. Yes, that was me at the front of the line in our local Get-a-Life Software store, waiting, waiting, for the moment when the future went on sale. And now that the future is installed in my computer, there's no looking back.\n\nTo be truthful, I don't use computers. They use me. They use me as a portal between the glittering new world of information and the mundane world where ordinary people have to eat and talk and sometimes be sad. Computers use my nimble fingers to unlock their codes, releasing raw information into the ether. Taking my mission as seriously as I do, I wanted the most up-to-the-second tool on the market. And that's why, the day after I installed Windows 2001, I was back at Get-a-Life buying the upgrade, Windows 2001, version 2.0.\n\nWith Windows 2001 2.0, I don't process information. I download it into my body. Using Windows' revolutionary US-ME serial port installed in my navel, I plug myself into my computer. Like the umbilical cord that fed me when I was mere flesh, the US-ME cable feeds raw data straight into my bloodstream. There it flows until it reaches the central processing unit I used to call my brain. And there, Windows' revolutionary Brain Bot - a tiny microchip embedded in my cerebrum -- turns that raw data into wisdom that makes me smarter, richer, and so much wiser than the rest of you.\n\nDid you know that the capital of Uganda is Kampala? That Soupy Sales had a lion puppet named Pookie? That the square root of 3 is 1.732? And that today's kids will spend 23 years of their lives on the Internet swimming through vital data like this? O, it's a changing world, my friend. When you leave your Silicon Valley job for two weeks of R & R, take a cruise to Antarctica, step onto an ice floe and see penguins crowded around a laptop checking out The Weather Channel, get worried!\n\nBut I'm not worried, I'm wired. Wired to the upgraded upgrade I bought last weekend. Windows 2001 3.0 is the one with HandPrint, the printer driver that drives my digital age. Using HandPrint, I don't need an ordinary printer. I just click a button on my wrist and my hand begins scrolling across a blank page printing my raw data in any of 1,257 perfect fonts. The moving hand writes, and having writ, gives way to ear-mail.\n\nI know, I know. You all have e-mail accounts. You can e-mail Bill Gates if you want. The Pope. Your dog if you're on vacation in Antarctica. But only Windows 2001 4.0, which I bought yesterday, has ear-mail.\n\nWhen I hear a voice from the ether saying \"You've got mail!\" I run to the nearest phone. Then I run my ear-mail cord from the phone to an input implanted below my left ear. Within seconds, I'm hearing the mail read by a soothing voice that sounds a little like James Earl Jones on Prozac. To reply, I simply speak my answer, press the same button on my wrist, and presto. I unplug and go back to my daily duty of becoming richer,\nsmarter, and wiser. There's also a wireless version of e-mail but that won't come out until version 5.0 is released tomorrow. I plan to get in line at Get-a-Life sometime before midnight.\n\nBut where, you ask, is this wireless world headed? To be truthful, I'm not sure, but it sure is fun. Perhaps when I'm even richer, smarter, and wiser than I am now, thanks to\nWindows 2001 6.0 due out this weekend, I'll have an answer. Until then, you'll have to excuse me. I have mail.",
    "An old, bearded shepherd, with a crooked staff, walks up to a stone pulpit and says:\n\n\"And lo it came to pass that the trader by the name of Abraham Com did take unto himself a young wife by the name of Dot. And Dot Com was a comely woman, broad of shoulder and long of leg. Indeed, she had been called Amazon Dot Com. And she said unto Abraham, her husband, \"Why doth thou travel far, from town to town, with thy goods when thou can trade without ever leaving thy tent?\"\n\nAnd Abraham did look at her as though she were several saddle bags short of a camel load, but simply said, \"How, Dear?\" And Dot replied, \"I will place drums in all the towns and drums in between to send messages saying what you have for sale and they will reply telling you which hath the best price. And the sale can be made on the drums and delivery made by Uriah's Pony Stable (UPS)\".\n\nAbraham thought long and decided he would let Dot have her way with the drums. And the drums rang out and were an immediate success. Abraham sold all the goods he had, at the top price, without ever moving from his tent. But this success did arouse envy. A man named Maccabia did secrete himself inside Abraham's drum and was accused of insider trading. And the young man did take to Dot Com's trading as doth the greedy horsefly take to camel dung.\n\nThey were called Nomadic Ecclesiastical Rich Dominican Siderites, or NERDS for short. And lo the land was so feverish with joy at the new riches and the deafening sound of drums, that no one noticed that the real riches were going to the drum maker, one Brother William of Gates, who bought up every drum company in the land. And indeed did insist on making drums that would only work if you bought Brother Gates' drumsticks.\n\nAnd Dot did say, \"Oh, Abraham, what we have started is being taken over by others\". And as Abraham looked out over the Bay of Ezekiel, or as it came to be known, \"eBay,\" he said, \"we need a name of a service that reflects what we are,\" and Dot replied, \"Young Ambitious Hebrew Owner Operators.\" \"Whoopee!\", said Abraham. \"No, YAHOO!\", said Dot Com.",
    "No, Windows is not a virus. Here's what viruses do:",
    "This is an actual alert to IBM Field Engineers that went out to all IBM\nBranch Offices. The person who wrote it was very serious. The rest of us\nguys find it rather funny.\n\n    P/N 33F8462 - Domestic Mouse Balls\n    P/N 33F8461 - Foreign Mouse Balls",
    "Loading, loading, loading,\nDamn this Java coding,\nFeeling of foreboding, Reload!\nThe Applet says it's running,\nAnd that big gray block is stunning,\nBut the screen remains as blank as my mind\nNetscape crash, Boot 'em up!\nNet goes down, Dial back!\nLogging on, Still off-line!\nReload!\nTry it now, Still not up!\nNetscape crashed, What, again?\nBoot it up, Log it in,\nReload!\n\nTighten, tweaking', smoothen,\nThey say the codes improvin',\nSo how come I'm still usin' \"reload\"?\nI'm tired of all this waitin',\nJust give me .gif animation,\nThis code is only good for wasting time,\nThe applet says it's running,\nAnd gray block is quite stunning,\nBut the screen remains as blank as my mind,",
    "If you're brain required an operating system like your computer\ndoes, what would it be like?",
    "For immediate issue:\nPassword Security Guidelines V2.2b\n\nDue to new security policies, the following guidelines have been issued to assist in choosing new passwords. Please follow them closely.\n\nPasswords must conform to at least 21 of the following attributes.",
    "The Lord is my programmer, I shall not crash.\nHe installed His software on the hard disk of my heart,\nAll of His commands are user friendly,\nHis directory moves me to the right choices for His name's sake.\n\nEven though I scroll through the problems of file,\nI will fear no bugs, for You are my backup;\nYour password protects me;\nYou prepare a menu before me in the presence of my enemies;\nYour help is only a key away.\n\nSurely goodness and mercy will follow me all the days of my life,\nAnd my file will be merged with His and saved forever.",
    "You know you're a good ol' boy computer operator if...",
    "A computer was something on tv\nFrom a science fiction show\nA window was something you hated to clean...\nAnd ram was the cousin of a goat...\n\nMeg was the name of my girlfriend\nAnd gig was your middle finger upright\nNow they all mean different things\nAnd that really mega bytes\n\nAn application was for employment\nA program was a tv show\nA cursor used profanity\nA keyboard was a piano\n\nMemory was something that you lost with age\nA cd was a bank account\nAnd if you had a 3 1/2\" floppy\nYou hoped nobody found out\n\nCompress was something you did to the garbage\nNot something you did to a file\nAnd if you unzipped anything in public\nYou'd be in jail for a while\n\nLog on was adding wood to the fire\nHard drive was a long trip on the road\nA mouse pad was where a mouse lived\nAnd a backup happened to your commode\n\nCut you did with a pocket knife\nPaste you did with glue\nA web was a spider's home\nAnd a virus was the flu\n\nI guess I'll stick to my pad and paper\nAnd the memory in my head\nI hear nobody's been killed in a computer crash\nBut when it happens they wish they were dead",
    "Computers will never be completely \"Idiot Proof\" because Idiots continue to be so resourceful.",
    "A peek into the thoughts of computer techs worldwide ...an end user's guide to technical services.",
    "New York -- People for Ethical Treatment of Software (PETS) announced today that seven more software companies have been added to the group's \"watch list\" of companies that regularly practice software testing.\n\n\"There is no need for software to be mistreated in this way so that companies like these can market new products,\" said Ken Grandola, spokesperson for PETS. \"Alternative methods of testing these products are available.\"\n\nAccording to PETS, these companies force software to undergo lengthy and arduous tests, often without rest, for hours or days at a time. Employees are assigned to \"break\" the software by any means necessary, and inside sources report that they often joke\nabout \"torturing\" the software.\n\n\"It's no joke,\" said Grandola. \"Innocent programs, from the day they are compiled, are cooped up in tiny rooms and \"crashed\" for hours on end. They spend their whole lives on dirty, ill-maintained computers, and are unceremoniously deleted when they're not needed anymore.\"\n\nGrandola said the software is kept in unsanitary conditions and is infested with bugs.\n\n\"We know that alternatives to this horror exist,\" he said, citing industry giant Microsoft Corporation as a company that has become successful without resorting to software testing.",
    "The annual internet clean up campaign will take place on the evening of March 31st beginning at 9pm EST and continue until April 1st 9am EST. This annual event occurs to remove the trash that forms on the internet throughout the year. Without this annual cleanup campaign the Internet would become so overrun with trash that its ability to pass information back and forth would become severely restricted.\n\n\nAll internet users are advised to take the following precautions to prevent damage or loss of information:",
    "WARNING! WARNING! WARNING! WARNING! WARNING! WARNING! WARNING!\n\nIf you receive an e-mail with a subject of \"Badtimes,\" delete it immediately WITHOUT reading it. This is the most viscous and dangerous Email virus yet.\n\nIt will re-write your hard drive. Not only that, but it will scramble any disks that are even close to your computer.\n\nIt will recalibrate your refrigerator's coolness setting so all your ice cream gets melted.\n\nIt will demagnetize the strips on all your credit cards, screw up the tracking on your VCR and use subspace field harmonics to scratch any CD's you try to play.\n\nIt will give your ex-boy/girlfriend your new phone number.\n\nIt will mix antifreeze into your fishtank. It will drink all your beer and leave its socks out on the coffee table when there's company coming over. It will put a dead kitten in the back pocket of your good suit and hide your car keys when you are late for work.\n\nBadtimes will make you fall in love with a penguin.\n\nIt will give you nightmares about circus midgets.\n\nIt will pour sugar in your gas tank and shave off both your eyebrows while dating your current boy/girlfriend behind your back and billing the dinner and hotel room to your Visa card.\n\nIt will seduce your grandmother. It does not matter if she is dead, such is the power of Badtimes, it reaches out beyond the grave to sully those things we hold most dear.\n\nIt moves your car randomly around parking lots so you can't find it.\n\nIt will kick your dog.\n\nIt will leave libidinous messages on your boss's voice mail in your voice!\n\nIt is insidious and subtle.",
    "Come and listen to a story 'bout a man named Jed,\nA poor college kid, barely kept his family fed,\nBut one day he was talking to a recruiter,\nWho said, \"they pay big bucks if ya work on a computer...\"\n\nUNIX, that is... CRTs... Workstations...\n\nWell, the first thing ya know ol' Jed's an Engineer.\nThe kinfolk said \"Jed, move away from here\".\nThey said \"Arizona is the place ya oughta be\",\nSo he bought a box of donuts and he moved to Ahwatukee...\n\nIntel, that is... dry heat... no amusement parks...\n\nOn his first day at work, they stuck him in a cube.\nFed him mo' donuts and sat him at a tube.\nSaid \"yo project's outta budget, but we know just what to do.\nInstead of 40 hours, we'll work you 52!\"\n\nOT, that is... unpaid... mandatory...\n\nThe weeks rolled by and things were looking bad.\nSchedules were slipping and the boss was getting mad.\nThey called another meeting and decided on a fix.\nThe answer was simple... \"We'll work him sixty-six!\"\n\nTired, that is... stressed out... no social life...\n\nMonths turned to years and his hair was turning grey.\nJed worked hard while his life just slipped away.\nWaiting to retire when he turned to 64,\nInstead he got a call and escorted out the door.\n\nLaid off, that is... lead hand shake... unemployed...\n\nNow the moral of the story is listen to what you're told,\nCompanies will use you and discard you when you're old.\nSo gather up your friends and start your own firm,\nBeat the competition, watch the bosses squirm.\n\nMillionaires, that is... Bill Gates... Steve Jobs...\n\nY'all come back now... ya hear'",
    "8:05am\nUser called to say they forgot password. Told them to use password\nretrieval utility called FDISK. Blissfully ignorant, they thank me and\nhang up. God, we let the people vote and drive, too?\n\n8:12am\nAccounting called to say they couldn't access expense reports database.\nGave them Standard Sys Admin Answer #112, \"Well, it works for me.\" Let\nthem rant and rave while I unplugged my coffeemaker from the UPS and plugged\ntheir server back in. Suggested they try it again. One more happy customer...\n\n8:14 am\nUser from 8:05 call said they received error message \"Error accessing\nDrive 0.\" Told them it was an OS problem. Transferred them to microsupport.\n\n11:00 am\nRelatively quiet for last few hours. Decide to plug support phone back\nin so I can call my girlfriend. Says parents are coming into town this\nweekend. Put her on hold and transferred her to janitorial closet down\nin basement. What is she thinking? The \"Myst\" and \"Doom\" nationals are\nthis weekend!\n\n11:34 am\nAnother user calls (do they ever learn?). Says they want ACL changed\non HR performance review database so that nobody but HR can access database.\nTell them no problem. Hang up. Change ACL. Add @MailSend so performance\nreviews are sent to */US.\n\n12:00 pm\nLunch\n\n3:30 pm\nReturn from lunch.\n\n3:55 pm\nWake up from nap. Bad dream makes me cranky. Bounce servers for no\nreason. Return to napping.\n\n4:23 pm\nYet another user calls. Wants to know how to change fonts on form.\nAsk them what chip set they're using. Tell them to call back when they\nfind out.\n\n4:55 pm\nDecide to run \"Create Save/Replication Conflicts\" macro so next shift\nhas something to do.\n\nTuesday\n8:30 am\nFinish reading support log from last night. Sounded busy. Terrible\ntime with Save/Replication conflicts.\n\n9:00 am\nSupport manager arrives. Wants to discuss my attitude. Click on PhoneNotes\nSmartIcon. \"Love to, but kinda busy. Put something in the calendar database!\"\nI yell as I grab for the support lines, which have (mysteriously) lit up.\nWalks away grumbling.\n\n9:35 pm\nTeam leader from R&D needs ID for new employee. Tell them they\nneed form J-19R=9C9\\DARRK1. Say they never heard of such a form. Tell\nthem it's in the SPECIAL FORMS database. Say they never heard of such a\ndatabase. Transfer them to janitorial closet in basement.\n\n10:00 am\nPerky sounding intern from R&D calls and says she needs new ID.\nTell her I need employee number, department name, manager name, and marital\nstatus. Run @DbLookup against state parole board database, Centers for\nDisease Control database, and my Oprah Winfrey database. No hits. Tell\nher ID will be ready tonight. Drawing from the lessons learned in last\nweek's \"Reengineering for Customer Partnership,\" I offer to personally\ndeliver ID to her apartment.\n\n10:07 am\nJanitor stops by to say he keeps getting strange calls in basement.\nOffer to train him on Notes. Begin now. Let him watch console while I grab\na smoke.\n\n1:00 pm\nReturn from smoking break. Janitor says phones kept ringing, so he\ntransferred them to cafeteria lady. I like this guy.\n\n1:05 pm\nBig commotion! Support manager falls in hole left where I pulled floor\ntiles outside his office door. Stress to him importance of not running\nin computer room, even if I do yell \"Omigod -- Fire!\"\n\n1:15 pm\nDevelopment Standards Committee calls and complains about umlauts in\nform names. Apologizing for the inconvenience, I tell them I will fix it.\nHang up and run global search/replace using gaks.\n\n1:20 pm\nMary Hairnet from cafeteria calls. Says she keeps getting calls for\n\"Notice Loads\" or \"NoLoad Goats,\" she's not sure, couldn't here over industrial-grade\nblender. Tell her it was probably \"Lettuce Nodes.\" Maybe the food distributor\nwith a new product? She thinks about it and hangs up.\n\n2:00 pm\nLegal secretary calls and says she lost password. Ask her to check\nin her purse, floor of car, and on bathroom counter. Tell her it probably\nfell out of back of machine. Suggest she put duct tape over all the airvents\nshe can find on the PC. Grudgingly offer to create new ID for her while\nshe does that.\n\n2:49 pm\nJanitor comes back. Wants more lessons. I take off rest of day.\n\nWednesday\n8:30 am\nIrate user calls to say chipset has nothing to do with fonts on form.\nTell them Of course, they should have been checking \"Bitset,\" not \"chipset.\"\nSheepish user apologizes and hangs up.\n\n9:10am\nSupport manager, with foot in cast, returns to office. Schedules 10:00am\nmeeting with me. User calls and wants to talk to support manager about\nterrible help at support desk. Tell them manager about to go into meeting.\nSometimes life hands you material...\n\n10:00 am\nCall Louie in janitorial services to cover for me. Go to support manager's\noffice. He says he can't dismiss me but can suggest several lateral career\nmoves. Most involve farm implements in third-world countries with moderate\nto heavy political turmoil. By and by, I ask if he's aware of new bug which\ntakes full-text indexed random e-mail databases and puts all references\nto furry handcuffs and Bambi Boomer in Marketing on the corporate Web page.\nMeeting is adjourned as he reaches for keyboard, Web browser, and Tums.\n\n10:30 am\nTell Louie he's doing great job. Offer to show him mainframe corporate\nPBX system sometime.\n\n11:00 am\nLunch.\n\n4:55 pm\nReturn from lunch.\n\n5:00 pm\nShift change; Going home.\n\nThursday\n8:00 am\nNew guy (\"Marvin\") started today. \"Nice plaids\" I offer. Show him server\nroom, wiring closet, and technical library. Set him up with IBM PC-XT.\nTell him to quit whining, Notes runs the same in both monochrome and color.\n\n8:45 am\nNew guy's PC finishes booting up. Tell him I'll create new ID for him.\nSet minimum password length to 64. Go grab smoke.\n\n9:30 am\nIntroduce Louie the custodian to Marvin. \"Nice plaids\" Louie comments.\nIs this guy great or what?!\n\n11:00 am\nBeat Louie in dominos game. Louie leaves. Fish spare dominos out of\nsleeves (\"Always have backups\"). User calls, says Accounting server is\ndown. Untie Ethernet cable from radio antenna (better reception) and plug\nback into hub. Tell user to try again. Another happy customer!\n\n11:55 am\nBrief Marvin on Corporate Policy 98.022.01:\n\n\"Whereas all new employee beginning on days ending in 'Y' shall enjoy\nall proper aspects with said corporation, said employee is obligated to\nprovide sustenance and relief to senior technical analyst on shift.\"\n\nMarvin doubts. I point to \"Corporate Policy\" database (a fine piece\nof work, if I say so myself!). \"Remember, that's DOUBLE pepperoni and NO\npeppers!\" I yell to Marvin as he steps over open floor tile to get to exit\ndoor.\n\n1:00 pm\nOooooh! Pizza makes me so sleepy...\n\n4:30 pm\nWake from refreshing nap. Catch Marvin scanning want ads.\n\n5:00 pm\nShift change. Flick HR's server off and on several times (just testing\nthe On/Off button...). See ya tomorrow.\n\nFriday\n8:00 am\nNight shift still trying to replace power supply in HR server. Told\nthem it worked fine before I left.\n\n9:00 am\nMarvin still not here. Decide I might start answering these calls myself.\nUnforward phones from Mailroom.\n\n9:02 am\nYep. A user call. Users in Des Moines can't replicate. Me and the Oiuji\nboard determine it's sunspots. Tell them to call Telecommunications.\n\n9:30 am\nGood God, another user! They're like ants. Says he's in San Diego and\ncan't replicate with Des Moines. Tell him it's sunspots, but with a two-hour\ndifference. Suggest he reset the time on the server back two hours.\n\n10:17 am\nPensacola calls. Says they can't route mail to San Diego. Tell them\nto set server ahead three hours.\n\n11:00 am\nE-mail from corporate says for everybody to quit resetting the time\non their servers. I change the date stamp and forward it to Milwaukee.\n\n11:20 am\nFinish @CoffeeMake macro. Put phone back on hook.\n\n11:23 am\nMilwaukee calls, asks what day it is.\n\n11:25 am\nSupport manager stops by to say Marvin called in to quit. \"So hard\nto get good help...\" I respond. Support manager says he has appointment\nwith orthopedic doctor this afternoon, and asks if I mind sitting in on\nthe weekly department head meeting for him. \"No problem!\"\n\n11:30 am\nCall Louie and tell him opportunity knocks and he's invited to a meeting\nthis afternoon. \"Yeah, sure. You can bring your snuff\" I tell him.\n\n12:00 am\nLunch.\n\n1:00 pm\nStart full backups on UNIX server. Route them to device NULL to make\nthem fast.\n\n1:03 pm\nFull weekly backups done. Man, I love modern technology!\n\n2:30 pm\nLook in support manager's contact management database. Cancel 2:45pm\nappointment for him. He really should be at home resting, you know.\n\n2:39 pm\nNew user calls. Says want to learn how to create a connection document.\nTell them to run connection document utility CTRL-ALT-DEL. Says PC rebooted.\nTell them to call microsupport.\n\n2:50 pm\nSupport manager calls to say mixup at doctor's office means appointment\ncancelled. Says he's just going to go on home. Ask him if he's seen corporate\nWeb page lately.\n\n3:00 pm\nAnother (novice) user calls. Says periodic macro not working. Suggest\nthey place @DeleteDocument at end of formula. Promise to send them document\naddendum which says so.\n\n4:00 pm\nFinish changing foreground color in all documents to white. Also set\npoint size to \"2\" in help databases.\n\n4:30 pm\nUser calls to say they can't see anything in documents. Tell them to\ngo to view, do a \"Edit -- Select All\", hit delete key, and then refresh.\nPromise to send them document addendum which says so.\n\n4:45 pm\nAnother user calls. Says they can't read help documents. Tell them\nI'll fix it. Hang up. Change font to Wingdings.\n\n4:58 pm\nPlug coffee maker into Ethernet hub to see what happens. Not (too)\nmuch.\n\n5:00 pm\nNight shift shows up. Tell that the hub is acting funny and to have\na good weekend.",
    "***** WARN AS MANY PEOPLE AS YOU CAN. *****\n\nThis is straight from DC:\n\nIf you receive an email entitled \"Badtimes\", delete it IMMEDIATELY.\n\nDo not open it. Apparently this one is pretty nasty. It will not only erase everything on your hard drive, but it will also delete anything on disks within 20 feet of your computer. It demagnetizes the strips on ALL of your credit cards.\n\nIt reprograms your ATM access code, screws up the tracking on your VCR and uses subspace field harmonics to scratch any CD's you attempt to play.It will program your phone auto-dial to call only 900 numbers. This virus will mix antifreeze into your fish tank.\n\nIT WILL CAUSE YOUR TOILET TO FLUSH WHILE YOU ARE SHOWERING.\n\nIt will drink ALL your beer. FOR GOD'S SAKE, ARE YOU LISTENING??\n\nIt will leave dirty underwear on the coffee table when you are expecting company. It will replace your shampoo with Nair and you Nair with Rogaine, all the while dating your current boy/girlfriend behind your back and billing their hotel rendezvous to your Visa card. It will cause you to run with scissors and throw things in a way that is only fun until someone loses an eye.\n\nIt will rewrite your backup files, changing all your active verbs to passive tense and incorporating undetectable misspellings which grossly change the interpretations of key sentences.\n\nIf the \"Badtimes\" message opened in a Windows 95/98 environment, it will leave the toilet seat up and leave your hair dryer plugged in dangerously close to a full bathtub. It will not only remove the forbidden tags from your mattresses and pillows, It will also refill your skim milk with whole milk.",
    "If a packet hits a pocket on a socket on a port,\nAnd the bus is interrupted as a very last resort,\nAnd the address of the memory makes your floppy disk abort, Then\nthe socket packet pocket has an error to report!\n\nIf your cursor finds a menu item followed by a dash,\nAnd the double-clicking icons put your window in the trash, And\nyour data is corrupted 'cause the index doesn't hash, Then your\nsituation's hopeless, and your system's gonna crash!\n\nIf the label on your cable on the gable at your house,\nSays the network is connected to the button on your mouse,\nBut your packets want to tunnel to another protocol,\nThat's repeatedly rejected by the printer down the hall.\n\nAnd your screen is all distorted by the side effects of gauss, So\nyour icons in the window are as wavy as a souse, Then you may as\nwell reboot and go out with a bang, 'Cause as sure as I'm a poet,\nthe sucker's gonna hang!\n\nWhen the copy of your floppy's getting sloppy on the disk,\nAnd the microcode instructions cause unnecessary RISC,\nThen you have to flash your memory and you'll want to RAM your\nROM, Quickly turn off your computer and be sure to tell your mom!",
    "QUESTION: Where do the characters go when I use my backspace or delete them on my computer?\n\nANSWER: The characters go to different places, depending on whom you ask:",
    "I had run across the term cyber sex a few times lately, so I\ndecided to try to figure out what it meant.  I figured it had\nsomething to do with the computer, so I started trying to find\nthe sex drive on mine.  I looked everywhere, in all the folders\non the My Computer section, the add/uninstall software,\ninstall hardware part of the control panel, then I got out all the\nmanuals and went through them.  I finally came to the conclusion\nthat my computer is not equipped with one."
]